# Required taps
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "snyk/tap"
tap "trufflesecurity/trufflehog"
tap "warrensbox/tap"

# Installs
brew "avro-c"
brew "libssh2"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "cairo"
brew "container-structure-test"
brew "coreutils"
brew "curlie"
brew "detect-secrets"
brew "dog"
brew "driftctl"
brew "duf"
brew "dust"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "git"
brew "git-lfs"
brew "git-secrets"
brew "gitleaks"
brew "glab"
brew "glances"
brew "python@3.11"
brew "gobject-introspection"
brew "gping"
brew "hadolint"
brew "helm"
brew "hugo"
brew "hyperfine"
brew "jless"
brew "jq"
brew "kafka"
brew "librdkafka"
brew "openssl@1.1"
brew "kcat"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "librsvg"
brew "libssh"
brew "poppler"
brew "pygobject3"
brew "mat2"
brew "minikube"
brew "nmap"
brew "qemu"
brew "podman"
brew "postgresql@15"
brew "virtualenv"
brew "pre-commit"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "ripgrep"
brew "shellcheck"
brew "terraform"
brew "tfsec"
brew "tlrc"
brew "tor"
brew "tree"
brew "trivy"
brew "util-linux"
brew "wget"
brew "zsh"
brew "hashicorp/tap/vault"
brew "snyk/tap/snyk"
brew "trufflesecurity/trufflehog/trufflehog"

# Casks
cask "authy"
cask "discord"
cask "keybase"
cask "maltego"
cask "microsoft-teams"
cask "podman-desktop"
cask "pritunl"
cask "protonvpn"
cask "signal"
cask "spotify"
cask "stremio"
cask "visual-studio-code"


# Visual Studio Code extensionss
vscode "alefragnani.Bookmarks"
vscode "azemoh.one-monokai"
vscode "chrmarti.regex"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "MS-SarifVSCode.sarif-viewer"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
vscode "withfig.fig"
