tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "minamijoyo/hcledit"
tap "nextdns/tap"
tap "nikitabobko/tap"
tap "snyk/tap"
tap "turbot/tap"
brew "jpeg-xl"
brew "apko"
brew "bat"
brew "glib"
brew "openblas"
brew "numpy"
brew "checkov"
brew "cookiecutter"
brew "cryptography"
brew "curlie"
brew "harfbuzz"
brew "openjdk"
brew "dependency-check"
brew "detect-secrets"
brew "dnsmasq"
brew "docker-slim"
brew "duf"
brew "dust"
brew "exiftool"
brew "libgit2"
brew "eza"
brew "fd"
brew "unbound"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "gitleaks"
brew "glow"
brew "libassuan"
brew "gnupg"
brew "gping"
brew "hadolint"
brew "hatch"
brew "htop"
brew "hydra"
brew "imagemagick"
brew "infracost"
brew "jless"
brew "jq"
brew "kcat"
brew "luajit"
brew "luv"
brew "make"
brew "mdcat"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "onefetch"
brew "opentofu"
brew "osv-scanner"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "podman-compose"
brew "postgresql@14"
brew "pre-commit"
brew "procs"
brew "protobuf"
brew "pyenv"
brew "pypy3.10"
brew "python-setuptools"
brew "qemu"
brew "ripgrep"
brew "ruff"
brew "rustscan"
brew "s3scanner"
brew "semgrep"
brew "sevenzip"
brew "sniffnet"
brew "telnet"
brew "terraform-docs"
brew "terrascan"
brew "tflint"
brew "tfsec"
brew "tfupdate"
brew "tldr"
brew "tree"
brew "trivy"
brew "typos-cli"
brew "wget"
brew "yazi"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"
brew "minamijoyo/hcledit/hcledit"
brew "nextdns/tap/nextdns"
brew "snyk/tap/snyk"
brew "turbot/tap/powerpipe"
cask "aerospace"
cask "android-platform-tools"
cask "bitwarden"
cask "discord"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "josm"
cask "keybase"
cask "linkliar"
cask "monitorcontrol"
cask "signal"
cask "spotify"
cask "visual-studio-code"
cask "zap"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
