# https://github.com/Homebrew/homebrew-bundle
# Taps
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "minamijoyo/hcledit"
tap "snyk/tap"

# Installs
brew "apko"
brew "bat"
brew "openblas"
brew "numpy"
brew "checkov"
brew "cookiecutter"
brew "curlie"
brew "dependency-check"
brew "detect-secrets"
brew "docker-slim"
brew "duf"
brew "dust"
brew "exiftool"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "gitleaks"
brew "glow"
brew "libassuan"
brew "gnupg"
brew "gping"
brew "hadolint"
brew "hatch"
brew "htop"
brew "hydra"
brew "infracost"
brew "jless"
brew "jq"
brew "kcat"
brew "luajit"
brew "luv"
brew "make"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "opentofu"
brew "osv-scanner"
brew "pinentry-mac"
brew "pipx"
brew "podman"
brew "postgresql@14"
brew "pre-commit"
brew "privoxy", restart_service: true
brew "procs"
brew "protobuf"
brew "pyenv"
brew "python-setuptools"
brew "ripgrep"
brew "ruff"
brew "s3scanner"
brew "telnet"
brew "terraform-docs"
brew "terrascan"
brew "tflint"
brew "tfsec"
brew "tfupdate"
brew "tldr"
brew "tree"
brew "trivy"
brew "typos-cli"
brew "wget"
brew "zig"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"
brew "minamijoyo/hcledit/hcledit"
brew "snyk/tap/snyk"

# Casks
cask "alacritty"
cask "discord"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "keybase"
cask "spotify"
cask "visual-studio-code"

# VS-code extensions
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
